# Virat Kohli : Batting Analysis (2008-2018):
**Virat Kohli** is an Indian cricketer. He was born in Delhi, India on November 5, 1988. Virat is the first player in ICC cricket history to win all 3 ICC awards in a single year- ICC ODI player of the year, ICC Test player of the year and ICC Player of the year award in 2018.

<img src="https://images.thequint.com/thequint%2F2018-01%2F5d369107-8477-4216-a39d-ad806e1d3a0c%2FVirat-century.jpg?rect=0%2C0%2C4650%2C2616&auto=format%2Ccompress&fmt=webp&w=700&dpr=1.0.jpg" width="500" height="500" />

**Born**: November 5, 1988, Delhi, India

**Team**: India national cricket team

**Sport**: Cricket

**Nationality**: India

**Data Dictionary**
1. RunsScored : Number of Runs scored by Kohli in the match.
2. BallsFaced : Number of Balls Faces by Kohli in the match.
3. BattingPosition : Batting position is Virat Kohli's position on the batting order.
4. Dismissal : How Kohli got out in the match or not out. Caught, NO: Not Out, Bowled, Run out, LBW, Stumped, Hit wicket.
5. Inning : An innings is one of the divisions of a match during which one team takes its turn to bat. Two 1st inning or 2nd inning.
6. Opposition : Name of the Opposition team.
7. Year : Year in which the match was played.

In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
from warnings import filterwarnings
filterwarnings("ignore")

In [6]:
# Read Bastman details file
mydata = pd.read_csv('Batsman.csv')

In [7]:
# View first 5 rows
mydata.head()

   RunsScored  BallsFaced  BattingPosition Dismissal  Inning Opposition  Year
0          12          22                2       LBW       1  Sri Lanka  2008
1          37          67                2    Caught       2  Sri Lanka  2008
2          25          38                1   Run out       1  Sri Lanka  2008
3          54          66                1    Bowled       1  Sri Lanka  2008
4          31          46                1       LBW       2  Sri Lanka  2008

In [8]:
# View first 10 rows
mydata.head(10)

,RunsScored,BallsFaced,BattingPosition,Dismissal,Inning,Opposition,Year
0,12,22,2,LBW,1,Sri Lanka,2008
1,37,67,2,Caught,2,Sri Lanka,2008
2,25,38,1,Run out,1,Sri Lanka,2008
3,54,66,1,Bowled,1,Sri Lanka,2008
4,31,46,1,LBW,2,Sri Lanka,2008
5,2,2,7,NO,1,Sri Lanka,2009
6,16,24,4,Caught,2,Pakistan,2009
7,79,104,4,NO,2,West Indies,2009
8,30,41,4,Caught,2,Australia,2009
9,10,16,3,Caught,2,Australia,2009

In [9]:
mydata.tail()

,RunsScored,BallsFaced,BattingPosition,Dismissal,Inning,Opposition,Year
203,140,107,3,Stumped,2,West Indies,2018
204,157,129,3,NO,1,West Indies,2018
205,107,119,3,Bowled,2,West Indies,2018
206,16,17,3,Caught,1,West Indies,2018
207,33,29,3,NO,2,West Indies,2018

In [10]:
# the data is successfully loaded and it can be observed that this data contains 
# Virat batting Scores based on Inning, Country (here Oppostion) and year. 
# It also shows his batting positions along with how many balls he faced.

Now , Understanding the shape of the dataset is also important

Let us now check the dimensions of the dataset by using the shape attribute.

The shape attribute will help us to get the number of rows and columns of the dataset.
Knowing the dimensions of the dataframe will help us to understand the number of data points we are working with 
and proves to be beneficial especially when the dataset is a large one (consisting of a large number of rows and columns).

In [11]:
#Shape of the data
mydata.shape

(208, 7)

Now we are aware of the shape of the dataframe. Let us now have a look at the types of data that we are working with.

The ***info()*** function will help us to understand the data types of the columns.

**Understanding data types ensures that data is stored in the preferred format and the value of each property is as expected.**

In [12]:
#Checking Info
mydata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208 entries, 0 to 207
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RunsScored       208 non-null    int64
 1   BallsFaced       208 non-null    int64
 2   BattingPosition  208 non-null    int64
 3   Dismissal        208 non-null    object
 4   Inning           208 non-null    int64
 5   Opposition       208 non-null    object
 6   Year             208 non-null    int64
dtypes: int64(5), object(2)
memory usage: 11.5+ KB

In [ ]:
# we can see here 5 columns are numeric (RunScored, BallsFaced, BattlingPosition, Inning and Year)
# whereas dismissal and Oppsition are categorical type

In [ ]:
mydata.info()

In [ ]:
# Now, year is not an integer

In [19]:
# Show just column names as a dataframe
mydata[:0]

Empty DataFrame
Columns: [RunsScored, BallsFaced, BattingPosition, Dismissal, Inning, Opposition, Year]
Index: []

In [31]:
type(mydata['RunsScored'])

pandas.core.series.Series

In [30]:
type(mydata[['RunsScored']])

pandas.core.frame.DataFrame

In [32]:
mydata['RunsScored']

0       12
1       37
2       25
3       54
4       31
      ...
203    140
204    157
205    107
206     16
207     33
Name: RunsScored, Length: 208, dtype: int64

In [23]:
mydata[['RunsScored','BallsFaced']]

     RunsScored  BallsFaced
0            12          22
1            37          67
2            25          38
3            54          66
4            31          46
..          ...         ...
203         140         107
204         157         129
205         107         119
206          16          17
207          33          29

[208 rows x 2 columns]

In [21]:
mydata.columns

Index(['RunsScored', 'BallsFaced', 'BattingPosition', 'Dismissal', 'Inning',
       'Opposition', 'Year'],
      dtype='object')

In [33]:
mydata

,RunsScored,BallsFaced,BattingPosition,Dismissal,Inning,Opposition,Year
0,12,22,2,LBW,1,Sri Lanka,2008
1,37,67,2,Caught,2,Sri Lanka,2008
2,25,38,1,Run out,1,Sri Lanka,2008
3,54,66,1,Bowled,1,Sri Lanka,2008
4,31,46,1,LBW,2,Sri Lanka,2008
...,...,...,...,...,...,...,...
203,140,107,3,Stumped,2,West Indies,2018
204,157,129,3,NO,1,West Indies,2018
205,107,119,3,Bowled,2,West Indies,2018
206,16,17,3,Caught,1,West Indies,2018
207,33,29,3,NO,2,West Indies,2018

In [ ]:
# Now, before attempting the questions, it is important to understand statistical summary of the data. 
# Getting the statistical summary for the user dataset

# The describe() function will help us in finding out the statistical summary.

# The statistical summary will give us a overview of the numerical columns of the data and 
# display various features like the minimum, maximum, mean, standard deviation, etc. of the columns. 
# This will help us to understand the distribution of the values present in the numerical columns.

# What each term represents and how we can make analysis will be taught in next module (Statistical Methods of Decision Making)

In [34]:
mydata.describe()

       RunsScored  BallsFaced  BattingPosition      Inning         Year
count  208.000000  208.000000       208.000000  208.000000   208.000000
mean    49.192308   52.961538         3.264423    1.567308  2013.240385
std     43.797641   39.850548         0.781602    0.496644     2.750477
min      0.000000    0.000000         1.000000    1.000000  2008.000000
25%     10.750000   18.000000         3.000000    1.000000  2011.000000
50%     35.000000   46.500000         3.000000    2.000000  2013.000000
75%     81.250000   83.250000         3.000000    2.000000  2015.000000
max    183.000000  159.000000         7.000000    2.000000  2018.000000

In [ ]:
# Here, some basic insights which we can get are that Virat Highest score is 183 and lowest 0.
# Virat has played 7 Battling positions
# On an average Virat scored 49 from year 2008 to 2018.

In [35]:
mydata['RunsScored'].sum()

10232

## Q 1. Against which opposition Virat has scored maximum Runs. Also, show the average score against each opposition.

In [36]:
mydata.head()

   RunsScored  BallsFaced  BattingPosition Dismissal  Inning Opposition  Year
0          12          22                2       LBW       1  Sri Lanka  2008
1          37          67                2    Caught       2  Sri Lanka  2008
2          25          38                1   Run out       1  Sri Lanka  2008
3          54          66                1    Bowled       1  Sri Lanka  2008
4          31          46                1       LBW       2  Sri Lanka  2008

In [38]:
mydata['Opposition'].value_counts()

Sri Lanka       45
West Indies     32
England         29
Australia       26
South Africa    24
New Zealand     19
Pakistan        12
Bangladesh      11
Zimbabwe         6
Ireland          2
Netherlands      1
U.A.E.           1
Name: Opposition, dtype: int64

In [43]:
total_run = mydata.groupby(['Opposition'])['RunsScored'].sum()
type(total_run.sort_values(ascending = False))
total_run.sort_values(ascending = False)

Opposition
Sri Lanka       2186
West Indies     1840
South Africa    1269
Australia       1182
New Zealand     1154
England         1112
Bangladesh       654
Pakistan         459
Zimbabwe         253
Ireland           78
U.A.E.            33
Netherlands       12
Name: RunsScored, dtype: int64

In [48]:
total_run.sort_values(ascending = False).reindex()

Opposition
Sri Lanka       2186
West Indies     1840
South Africa    1269
Australia       1182
New Zealand     1154
England         1112
Bangladesh       654
Pakistan         459
Zimbabwe         253
Ireland           78
U.A.E.            33
Netherlands       12
Name: RunsScored, dtype: int64

In [52]:
total_groupby = mydata.groupby(['Opposition'])['RunsScored'].sum().reset_index()
total_groupby.sort_values('RunsScored',ascending = False)

      Opposition  RunsScored
8      Sri Lanka        2186
10   West Indies        1840
7   South Africa        1269
0      Australia        1182
5    New Zealand        1154
2        England        1112
1     Bangladesh         654
6       Pakistan         459
11      Zimbabwe         253
3        Ireland          78
9         U.A.E.          33
4    Netherlands          12

In [56]:
mydata[['Opposition','RunsScored']].groupby(['Opposition']).sum().sort_values('RunsScored',ascending = False)

              RunsScored
Opposition
Sri Lanka           2186
West Indies         1840
South Africa        1269
Australia           1182
New Zealand         1154
England             1112
Bangladesh           654
Pakistan             459
Zimbabwe             253
Ireland               78
U.A.E.                33
Netherlands           12

In [ ]:
# Virat has scored maximum runs while playing with Sri Lanka, however minimum scores when played with Netherlands

In [57]:
#Average
mydata.groupby(['Opposition'])['RunsScored'].mean().sort_values(ascending = False)

Opposition
New Zealand     60.736842
Bangladesh      59.454545
West Indies     57.500000
South Africa    52.875000
Sri Lanka       48.577778
Australia       45.461538
Zimbabwe        42.166667
Ireland         39.000000
England         38.344828
Pakistan        38.250000
U.A.E.          33.000000
Netherlands     12.000000
Name: RunsScored, dtype: float64

In [58]:
# median
mydata.groupby(['Opposition'])['RunsScored'].median().sort_values(ascending = False)

Opposition
Bangladesh      66.0
New Zealand     64.0
West Indies     46.0
South Africa    41.0
Ireland         39.0
Sri Lanka       37.0
England         35.0
U.A.E.          33.0
Australia       29.0
Zimbabwe        28.0
Pakistan        12.5
Netherlands     12.0
Name: RunsScored, dtype: float64

## Q 2. In which year, Virat has scored maximum Runs.

In [59]:
mydata.head()

   RunsScored  BallsFaced  BattingPosition Dismissal  Inning Opposition  Year
0          12          22                2       LBW       1  Sri Lanka  2008
1          37          67                2    Caught       2  Sri Lanka  2008
2          25          38                1   Run out       1  Sri Lanka  2008
3          54          66                1    Bowled       1  Sri Lanka  2008
4          31          46                1       LBW       2  Sri Lanka  2008

In [62]:
mydata.groupby(['Year'])['RunsScored'].sum().sort_values(ascending = True)

Year
2008     159
2009     325
2015     623
2016     739
2010     995
2012    1026
2014    1054
2018    1202
2013    1268
2011    1381
2017    1460
Name: RunsScored, dtype: int64

In [63]:
# Virat Scored maximum in year 2017 and Minimum in 2008.

## Q 3. In which year, Virat has scored maximum Runs with which Opposition?

In [66]:
mydata.groupby(['Year','Opposition'])['RunsScored'].sum().sort_values(ascending = False).head(1)

Year  Opposition
2012  Sri Lanka     695
Name: RunsScored, dtype: int64

## OR

In [70]:
mydata_year_ops = mydata.groupby(['Year','Opposition'])['RunsScored'].sum().sort_values(ascending = False).reset_index()
mydata_year_ops.head()

   Year    Opposition  RunsScored
0  2012     Sri Lanka         695
1  2018  South Africa         558
2  2011   West Indies         501
3  2011       England         472
4  2018   West Indies         453

In [75]:
mydata[mydata['Year'] == 2015].groupby(['Opposition'])['RunsScored'].sum().sort_values(ascending = False).head(1)

Opposition
South Africa    291
Name: RunsScored, dtype: int64

In [72]:
mydata_year_ops[mydata_year_ops['Year'] == 2015].head(1)

    Year    Opposition  RunsScored
12  2015  South Africa         291

In [ ]:
# Virat scored highest Runs in 2012 against Sri Lanka i.e. 695

## Q 4. In how many matches Virat was not out. (Consider Dismissal column here).

In [76]:
mydata.head()

   RunsScored  BallsFaced  BattingPosition Dismissal  Inning Opposition  Year
0          12          22                2       LBW       1  Sri Lanka  2008
1          37          67                2    Caught       2  Sri Lanka  2008
2          25          38                1   Run out       1  Sri Lanka  2008
3          54          66                1    Bowled       1  Sri Lanka  2008
4          31          46                1       LBW       2  Sri Lanka  2008

In [77]:
mydata['Dismissal'].value_counts()

Caught        121
NO             37
Bowled         21
LBW            12
Run out        12
Stumped         4
Hit wicket      1
Name: Dismissal, dtype: int64

In [ ]:
# Virat was not out in 37 matches

## Q 5. Find the number of times when kohli scored less than or equal to 7 runs?

In [80]:
mydata[mydata['RunsScored'] <= 7].shape[0]

40

## Q 6. With how many countries Virat has played matches. Consider the country only once. Name them.

In [81]:
mydata.head()

   RunsScored  BallsFaced  BattingPosition Dismissal  Inning Opposition  Year
0          12          22                2       LBW       1  Sri Lanka  2008
1          37          67                2    Caught       2  Sri Lanka  2008
2          25          38                1   Run out       1  Sri Lanka  2008
3          54          66                1    Bowled       1  Sri Lanka  2008
4          31          46                1       LBW       2  Sri Lanka  2008

In [82]:
mydata['Opposition'].nunique()

12

In [83]:
mydata['Opposition'].unique()

array(['Sri Lanka', 'Pakistan', 'West Indies', 'Australia', 'Bangladesh',
       'South Africa', 'Zimbabwe', 'New Zealand', 'England', 'Ireland',
       'Netherlands', 'U.A.E.'], dtype=object)

## Q7. Which countries are top competitors of India ? Show top 5.

In [86]:
mydata[['Opposition','RunsScored']].groupby(['Opposition']).sum().sort_values('RunsScored',ascending = True).head()

             RunsScored
Opposition
Netherlands          12
U.A.E.               33
Ireland              78
Zimbabwe            253
Pakistan            459

In [ ]:
# This question is similar to Q 1.

## Q 8. Compare the runs scored by Kohli in 1st innings vs the 2nd innings.

In [87]:
mydata.groupby(['Inning'])['RunsScored'].sum()

Inning
1    4060
2    6172
Name: RunsScored, dtype: int64

## Q 9. Which opposition has Kohli scored most runs against? Find the median score against different oppositions?

In [90]:
mydata.groupby(['Opposition'])['RunsScored'].agg(['sum', 'mean','median']).sort_values('sum',ascending = False)

               sum       mean  median
Opposition
Australia     1182  45.461538    29.0
Bangladesh     654  59.454545    66.0
England       1112  38.344828    35.0
Ireland         78  39.000000    39.0
Netherlands     12  12.000000    12.0
New Zealand   1154  60.736842    64.0
Pakistan       459  38.250000    12.5
South Africa  1269  52.875000    41.0
Sri Lanka     2186  48.577778    37.0
U.A.E.          33  33.000000    33.0
West Indies   1840  57.500000    46.0
Zimbabwe       253  42.166667    28.0

### Another way

## Q 10. What do you think how Kohli got out in most number of matches, show complete data about each Dismissal based on Inning?

In [91]:
mydata.head()

   RunsScored  BallsFaced  BattingPosition Dismissal  Inning Opposition  Year
0          12          22                2       LBW       1  Sri Lanka  2008
1          37          67                2    Caught       2  Sri Lanka  2008
2          25          38                1   Run out       1  Sri Lanka  2008
3          54          66                1    Bowled       1  Sri Lanka  2008
4          31          46                1       LBW       2  Sri Lanka  2008

In [94]:
mydata['Dismissal'].value_counts()

Caught        121
NO             37
Bowled         21
LBW            12
Run out        12
Stumped         4
Hit wicket      1
Name: Dismissal, dtype: int64

In [93]:
mydata[mydata['Year']==2008]['Dismissal'].value_counts()

LBW        2
Caught     1
Run out    1
Bowled     1
Name: Dismissal, dtype: int64

The most number of times Kohli has got out is by getting caught.

<img src="https://imgk.timesnownews.com/story/Zampa_Kohli.png?tr=w-600,h-450,fo-auto" width="500" height="200" />

 Apart from that he seems to stay not out for most of the innings and looks like it is hard to get him out by other ways apart from being caught.

##  Pre and Post transformation comparison

**It is well known that Kohli started taking fitness much more seriously post an ordinary IPL in 2012. He changed his training regime and eating habits completely, realising the need to transform his body to survive the rigours of playing all three formats.**

<img src= "https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcSskALcVu6o9iI-7Q_rsehBkQ4PpDN6IAjWwA&usqp=CAU" width="500" height="500" />

**Kohli says it was the absence of fear or respect for him in the opposition's eye that has forced him to change his work ethic
Kohli revealed how working on his fitness has lifted his game after coming back from the Australian tour in 2012
While he considers his idol Tendulkar's skills as a cricketer in a different league, his is a case of pure hard work**

In [95]:
# let's fetch the data post transform 
mydata['post_transform'] = mydata["Year"]>2012
mydata

,RunsScored,BallsFaced,BattingPosition,Dismissal,Inning,Opposition,Year,post_transform
0,12,22,2,LBW,1,Sri Lanka,2008,False
1,37,67,2,Caught,2,Sri Lanka,2008,False
2,25,38,1,Run out,1,Sri Lanka,2008,False
3,54,66,1,Bowled,1,Sri Lanka,2008,False
4,31,46,1,LBW,2,Sri Lanka,2008,False
...,...,...,...,...,...,...,...,...
203,140,107,3,Stumped,2,West Indies,2018,True
204,157,129,3,NO,1,West Indies,2018,True
205,107,119,3,Bowled,2,West Indies,2018,True
206,16,17,3,Caught,1,West Indies,2018,True
207,33,29,3,NO,2,West Indies,2018,True

## Q 11. Compare the runs Scored before and after transformation

In [99]:
mydata.groupby(['post_transform'])['RunsScored'].agg(['sum', 'mean','count'])

                 sum       mean  count
post_transform
False           3886  44.159091     88
True            6346  52.883333    120

In [ ]:
# Here, we can see a drastic change in his performance.
# We can see clearly see post transformation, he has scored more runs

## Q 12. Compare the Balls Faced before and after transformation

In [100]:
mydata.head()

,RunsScored,BallsFaced,BattingPosition,Dismissal,Inning,Opposition,Year,post_transform
0,12,22,2,LBW,1,Sri Lanka,2008,False
1,37,67,2,Caught,2,Sri Lanka,2008,False
2,25,38,1,Run out,1,Sri Lanka,2008,False
3,54,66,1,Bowled,1,Sri Lanka,2008,False
4,31,46,1,LBW,2,Sri Lanka,2008,False

In [101]:
mydata.groupby(['post_transform'])['BallsFaced'].agg(['sum', 'mean','count'])

                 sum       mean  count
post_transform
False           4501  51.147727     88
True            6515  54.291667    120

## Q 13. Compare the runs Scored before and after transformation as innings(innings wise)

In [103]:
mydata.groupby(['post_transform','Inning'])['RunsScored'].agg(['sum', 'mean','count'])

                        sum       mean  count
post_transform Inning
False          1       1384  36.421053     38
               2       2502  50.040000     50
True           1       2676  51.461538     52
               2       3670  53.970588     68

**Clearly, Kohli was good at chasing as compared to batting first, prior he went through the transformation. But post transformation, he has significantly improved his run scoring ability batting first.**

## Q 14. Compare the dismissal patterns before and after transformation.

In [116]:
mydata.pivot_table(values=['RunsScored'],
                   index=['post_transform'],
                   columns='Dismissal'
                  ,aggfunc='mean',
                   margins=True)

               RunsScored                                                      \
Dismissal          Bowled     Caught Hit wicket        LBW         NO Run out
post_transform
False           27.454545  42.000000      107.0  23.750000  82.166667    42.0
True            56.400000  42.397260        NaN  40.000000  80.480000    50.0
All             41.238095  42.239669      107.0  29.166667  81.027027    46.0


Dismissal      Stumped        All
post_transform
False             16.5  44.159091
True             107.5  52.883333
All               62.0  49.192308

In [114]:
# mydata.groupby(['post_transform','Dismissal'])['Dismissal'].agg(['count'])

The average score before getting stumped and bowled has drastically improved post transformation. Average runs scored before 'Run Out' has also improved.

## Q 15. Which batting position has helped Virat score highest Runs.

In [117]:
mydata.head()

,RunsScored,BallsFaced,BattingPosition,Dismissal,Inning,Opposition,Year,post_transform
0,12,22,2,LBW,1,Sri Lanka,2008,False
1,37,67,2,Caught,2,Sri Lanka,2008,False
2,25,38,1,Run out,1,Sri Lanka,2008,False
3,54,66,1,Bowled,1,Sri Lanka,2008,False
4,31,46,1,LBW,2,Sri Lanka,2008,False

In [119]:
mydata.groupby(['BattingPosition'])['RunsScored'].agg(['sum', 'mean','count']).sort_values('sum',ascending = False)

                  sum       mean  count
BattingPosition
3                8139  52.173077    156
4                1744  47.135135     37
5                 127  31.750000      4
1                 110  36.666667      3
2                  51  17.000000      3
7                  38   9.500000      4
6                  23  23.000000      1

In [120]:
mydata.pivot_table(values=['RunsScored'],
                   index=['BattingPosition'],
                   columns='post_transform'
                  ,aggfunc='mean',
                   margins=True)

                RunsScored
post_transform       False       True        All
BattingPosition
1                36.666667        NaN  36.666667
2                24.500000   2.000000  17.000000
3                44.620000  55.735849  52.173077
4                52.480000  36.000000  47.135135
5                41.000000   4.000000  31.750000
6                23.000000        NaN  23.000000
7                 9.500000        NaN   9.500000
All              44.159091  52.883333  49.192308

## Summary: Virat has been an outstanding perform post his transformation. If we talk about his best batting position it is 3. VK has scored more than 1000 runs till 2018. 
## We will see these results by visualization in next mentor learning session